loadtest/results/20260922-183711/3-mixed-95r-5w.txt
Running 1m test @ https://cache-api-alb-1834554219.us-east-1.elb.amazonaws.com
  4 threads and 200 connections
  Thread calibration: mean lat.: 108.358ms, rate sampling interval: 269ms
  Thread calibration: mean lat.: 107.941ms, rate sampling interval: 267ms
  Thread calibration: mean lat.: 117.188ms, rate sampling interval: 328ms
  Thread calibration: mean lat.: 116.683ms, rate sampling interval: 330ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    96.95ms   12.61ms 616.96ms   96.13%
    Req/Sec   124.72     44.78   187.00     82.62%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   95.04ms
 75.000%   98.75ms
 90.000%  103.36ms
 99.000%  143.23ms
 99.900%  316.93ms
 99.990%  364.03ms
 99.999%  617.47ms
100.000%  617.47ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      81.151     0.000000            1         1.00
      89.983     0.100000         2526         1.11
      91.455     0.200000         5033         1.25
      92.735     0.300000         7487         1.43
      93.887     0.400000        10002         1.67
      95.039     0.500000        12556         2.00
      95.615     0.550000        13759         2.22
      96.255     0.600000        15045         2.50
      96.959     0.650000        16211         2.86
      97.791     0.700000        17486         3.33
      98.751     0.750000        18766         4.00
      99.263     0.775000        19360         4.44
      99.839     0.800000        19988         5.00
     100.543     0.825000        20587         5.71
     101.375     0.850000        21227         6.67
     102.271     0.875000        21834         8.00
     102.783     0.887500        22143         8.89
     103.359     0.900000        22457        10.00
     104.127     0.912500        22790        11.43
     104.895     0.925000        23085        13.33
     105.983     0.937500        23388        16.00
     106.623     0.943750        23539        17.78
     107.519     0.950000        23699        20.00
     108.351     0.956250        23850        22.86
     109.631     0.962500        24005        26.67
     111.871     0.968750        24158        32.00
     113.663     0.971875        24236        35.56
     116.543     0.975000        24313        40.00
     120.255     0.978125        24391        45.71
     125.759     0.981250        24469        53.33
     133.247     0.984375        24547        64.00
     136.575     0.985938        24586        71.11
     139.391     0.987500        24628        80.00
     141.695     0.989062        24664        91.43
     144.127     0.990625        24704       106.67
     146.047     0.992188        24742       128.00
     147.455     0.992969        24762       142.22
     149.247     0.993750        24781       160.00
     152.319     0.994531        24802       182.86
     156.031     0.995313        24820       213.33
     160.511     0.996094        24839       256.00
     161.791     0.996484        24849       284.44
     164.607     0.996875        24859       320.00
     174.207     0.997266        24868       365.71
     183.935     0.997656        24878       426.67
     199.807     0.998047        24888       512.00
     209.151     0.998242        24893       568.89
     226.943     0.998437        24898       640.00
     238.335     0.998633        24902       731.43
     310.015     0.998828        24907       853.33
     317.439     0.999023        24912      1024.00
     319.487     0.999121        24915      1137.78
     322.047     0.999219        24917      1280.00
     322.559     0.999316        24919      1462.86
     323.327     0.999414        24923      1706.67
     324.863     0.999512        24924      2048.00
     328.959     0.999561        24926      2275.56
     329.983     0.999609        24927      2560.00
     330.239     0.999658        24928      2925.71
     332.287     0.999707        24929      3413.33
     332.799     0.999756        24930      4096.00
     349.439     0.999780        24931      4551.11
     358.143     0.999805        24932      5120.00
     358.143     0.999829        24932      5851.43
     362.495     0.999854        24933      6826.67
     362.495     0.999878        24933      8192.00
     364.031     0.999890        24934      9102.22
     364.031     0.999902        24934     10240.00
     364.031     0.999915        24934     11702.86
     365.823     0.999927        24935     13653.33
     365.823     0.999939        24935     16384.00
     365.823     0.999945        24935     18204.44
     365.823     0.999951        24935     20480.00
     365.823     0.999957        24935     23405.71
     617.471     0.999963        24936     27306.67
     617.471     1.000000        24936          inf
#[Mean    =       96.951, StdDeviation   =       12.608]
#[Max     =      616.960, Total count    =        24936]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29802 requests in 1.00m, 10.43MB read
  Non-2xx or 3xx responses: 3045
Requests/sec:    494.41
Transfer/sec:    177.16KB
------------------------------
X-Cache  HIT=22819  MISS=2776  BYPASS=0  writes=1162  http_errors=3045
Cache hit ratio: 89.15%
Socket errors: connect=0 read=0 write=0 timeout=0
p50       95.04 ms
p90      103.36 ms
p99      143.23 ms
p99.9    316.93 ms