loadtest/results/20260922-183711/4-step-1000rps.txt
Running 30s test @ https://cache-api-alb-1834554219.us-east-1.elb.amazonaws.com
  4 threads and 200 connections
  Thread calibration: mean lat.: 99.896ms, rate sampling interval: 205ms
  Thread calibration: mean lat.: 99.721ms, rate sampling interval: 205ms
  Thread calibration: mean lat.: 98.957ms, rate sampling interval: 204ms
  Thread calibration: mean lat.: 102.483ms, rate sampling interval: 207ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    95.43ms    5.21ms 227.97ms   78.94%
    Req/Sec   250.45     17.79   454.00     96.87%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   94.78ms
 75.000%   97.79ms
 90.000%  100.99ms
 99.000%  109.95ms
 99.900%  142.21ms
 99.990%  207.49ms
 99.999%  228.09ms
100.000%  228.09ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      84.863     0.000000            1         1.00
      90.239     0.100000         2002         1.11
      91.647     0.200000         4003         1.25
      92.799     0.300000         6023         1.43
      93.823     0.400000         7992         1.67
      94.783     0.500000         9938         2.00
      95.295     0.550000        10951         2.22
      95.807     0.600000        11879         2.50
      96.447     0.650000        12951         2.86
      97.023     0.700000        13851         3.33
      97.791     0.750000        14874         4.00
      98.175     0.775000        15344         4.44
      98.623     0.800000        15872         5.00
      99.071     0.825000        16336         5.71
      99.583     0.850000        16810         6.67
     100.223     0.875000        17309         8.00
     100.607     0.887500        17564         8.89
     100.991     0.900000        17799        10.00
     101.503     0.912500        18062        11.43
     102.015     0.925000        18295        13.33
     102.655     0.937500        18543        16.00
     103.039     0.943750        18671        17.78
     103.487     0.950000        18790        20.00
     103.999     0.956250        18907        22.86
     104.575     0.962500        19037        26.67
     105.279     0.968750        19165        32.00
     105.535     0.971875        19215        35.56
     106.047     0.975000        19282        40.00
     106.495     0.978125        19344        45.71
     107.071     0.981250        19401        53.33
     107.967     0.984375        19465        64.00
     108.351     0.985938        19493        71.11
     108.799     0.987500        19524        80.00
     109.503     0.989062        19555        91.43
     110.271     0.990625        19586       106.67
     111.295     0.992188        19619       128.00
     112.191     0.992969        19632       142.22
     113.151     0.993750        19648       160.00
     113.727     0.994531        19663       182.86
     115.519     0.995313        19680       213.33
     116.991     0.996094        19694       256.00
     118.399     0.996484        19702       284.44
     121.023     0.996875        19712       320.00
     121.791     0.997266        19717       365.71
     124.671     0.997656        19725       426.67
     127.743     0.998047        19733       512.00
     132.607     0.998242        19737       568.89
     138.239     0.998437        19741       640.00
     140.031     0.998633        19744       731.43
     141.311     0.998828        19748       853.33
     143.103     0.999023        19752      1024.00
     145.023     0.999121        19754      1137.78
     145.535     0.999219        19756      1280.00
     147.327     0.999316        19759      1462.86
     148.351     0.999414        19760      1706.67
     154.495     0.999512        19763      2048.00
     154.495     0.999561        19763      2275.56
     155.647     0.999609        19764      2560.00
     157.311     0.999658        19765      2925.71
     170.623     0.999707        19766      3413.33
     178.687     0.999756        19767      4096.00
     178.687     0.999780        19767      4551.11
     186.239     0.999805        19768      5120.00
     186.239     0.999829        19768      5851.43
     207.487     0.999854        19769      6826.67
     207.487     0.999878        19769      8192.00
     207.487     0.999890        19769      9102.22
     209.407     0.999902        19770     10240.00
     209.407     0.999915        19770     11702.86
     209.407     0.999927        19770     13653.33
     209.407     0.999939        19770     16384.00
     209.407     0.999945        19770     18204.44
     228.095     0.999951        19771     20480.00
     228.095     1.000000        19771          inf
#[Mean    =       95.426, StdDeviation   =        5.209]
#[Max     =      227.968, Total count    =        19771]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29670 requests in 30.09s, 10.92MB read
  Non-2xx or 3xx responses: 31
Requests/sec:    986.02
Transfer/sec:    371.51KB
------------------------------
X-Cache  HIT=28963  MISS=676  BYPASS=0  writes=0  http_errors=31
Cache hit ratio: 97.72%
Socket errors: connect=0 read=0 write=0 timeout=0
p50       94.78 ms
p90      100.99 ms
p99      109.95 ms
p99.9    142.21 ms