loadtest/results/20260922-183711/4-step-250rps.txt
Running 30s test @ https://cache-api-alb-1834554219.us-east-1.elb.amazonaws.com
  4 threads and 200 connections
  Thread calibration: mean lat.: 111.316ms, rate sampling interval: 233ms
  Thread calibration: mean lat.: 113.692ms, rate sampling interval: 244ms
  Thread calibration: mean lat.: 108.747ms, rate sampling interval: 220ms
  Thread calibration: mean lat.: 107.970ms, rate sampling interval: 220ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    95.84ms    7.03ms 319.49ms   88.30%
    Req/Sec    62.86     76.31   205.00     76.88%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   94.72ms
 75.000%   98.11ms
 90.000%  101.95ms
 99.000%  119.55ms
 99.900%  154.62ms
 99.990%  167.29ms
 99.999%  319.74ms
100.000%  319.74ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      84.671     0.000000            1         1.00
      90.175     0.100000          511         1.11
      91.391     0.200000         1001         1.25
      92.543     0.300000         1500         1.43
      93.631     0.400000         2005         1.67
      94.719     0.500000         2507         2.00
      95.359     0.550000         2761         2.22
      95.999     0.600000         3019         2.50
      96.639     0.650000         3258         2.86
      97.343     0.700000         3515         3.33
      98.111     0.750000         3769         4.00
      98.559     0.775000         3890         4.44
      99.071     0.800000         4009         5.00
      99.583     0.825000         4139         5.71
     100.223     0.850000         4260         6.67
     100.991     0.875000         4379         8.00
     101.375     0.887500         4438         8.89
     101.951     0.900000         4504        10.00
     102.591     0.912500         4564        11.43
     103.167     0.925000         4626        13.33
     103.935     0.937500         4691        16.00
     104.383     0.943750         4719        17.78
     105.215     0.950000         4750        20.00
     105.855     0.956250         4782        22.86
     107.071     0.962500         4814        26.67
     108.479     0.968750         4845        32.00
     109.183     0.971875         4862        35.56
     110.207     0.975000         4877        40.00
     111.359     0.978125         4891        45.71
     112.255     0.981250         4907        53.33
     114.239     0.984375         4922        64.00
     115.711     0.985938         4931        71.11
     116.863     0.987500         4938        80.00
     119.039     0.989062         4946        91.43
     120.319     0.990625         4954       106.67
     122.559     0.992188         4961       128.00
     123.455     0.992969         4965       142.22
     124.031     0.993750         4969       160.00
     127.935     0.994531         4973       182.86
     133.631     0.995313         4977       213.33
     135.167     0.996094         4982       256.00
     137.855     0.996484         4983       284.44
     138.111     0.996875         4985       320.00
     144.383     0.997266         4987       365.71
     146.943     0.997656         4989       426.67
     148.223     0.998047         4991       512.00
     148.479     0.998242         4992       568.89
     148.863     0.998437         4993       640.00
     151.551     0.998633         4994       731.43
     154.623     0.998828         4995       853.33
     157.311     0.999023         4997      1024.00
     157.311     0.999121         4997      1137.78
     157.311     0.999219         4997      1280.00
     157.311     0.999316         4997      1462.86
     161.919     0.999414         4998      1706.67
     161.919     0.999512         4998      2048.00
     161.919     0.999561         4998      2275.56
     167.295     0.999609         4999      2560.00
     167.295     0.999658         4999      2925.71
     167.295     0.999707         4999      3413.33
     167.295     0.999756         4999      4096.00
     167.295     0.999780         4999      4551.11
     319.743     0.999805         5000      5120.00
     319.743     1.000000         5000          inf
#[Mean    =       95.845, StdDeviation   =        7.030]
#[Max     =      319.488, Total count    =         5000]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7550 requests in 30.26s, 2.77MB read
  Non-2xx or 3xx responses: 40
Requests/sec:    249.49
Transfer/sec:     93.85KB
------------------------------
X-Cache  HIT=6998  MISS=512  BYPASS=0  writes=0  http_errors=40
Cache hit ratio: 93.18%
Socket errors: connect=0 read=0 write=0 timeout=0
p50       94.72 ms
p90      101.95 ms
p99      119.55 ms
p99.9    154.62 ms